package com.example.love_shayari;

import java.io.File;

public class config{

    public static File file;
    public static String[] category_shayary={"attitude","love","birthday","child","bewfa"};

    public static int[] category_images={R.drawable.attitude,R.drawable.love,R.drawable.birthday,
            R.drawable.boyfriendgirl,R.drawable.child,R.drawable.bewfa};

    public static int[] colors={R.color.Blue,R.color.black,R.color.Fuchsia,R.color.Gray,R.color.Navy,
            R.color.green,R.color.Maroon,R.color.Olive,R.color.purple_200,R.color.purple_500,
            R.color.purple_700,R.color.teal_200,R.color.teal_700,R.color.Silver,R.color.white,R.color.Yellow};

    public static String[] font={"GJAV0NTT.TTF","GJAV0XTT.TTF","GJCT0BTT.TTF","GJCT0ITT.TTF","GJCT0NTT.TTF",
            "GJCT0XTT.TTF","GJDW0BTT.TTF","GJDW0ITT.TTF","GJKE0XTT.TTF","GJKP0NTT.TTF","GJKP0XTT.TTF",
            "GJKR0ITT.TTF","GJMN0BTT.TTF","GJMN0NTT.TTF"};

    public static int[] grediant={R.drawable.g1,R.drawable.g2,R.drawable.g3,R.drawable.g4,R.drawable.g5,
            R.drawable.g6,R.drawable.g7,R.drawable.g8,R.drawable.g9,R.drawable.g10};

    public static String[] emoji={"\uD83D\uDE00 \uD83D\uDE03 \uD83D\uDE04 \uD83D\uDE01 \uD83D\uDE06",
            "\uD83E\uDD29 \uD83E\uDD73 \uD83D\uDE0F \uD83D\uDE12 \uD83D\uDE1E \uD83D\uDE14 \uD83D\uDE1F",
            "\uD83D\uDC76 \uD83D\uDC67 \uD83E\uDDD2 \uD83D\uDC66 \uD83D\uDC69 \uD83E\uDDD1 \uD83D\uDC68 \uD83D\uDC69\u200D\uD83E\uDDB1 ",
            "\uD83D\uDC68\u200D\uD83E\uDDB1 \uD83D\uDC69\u200D\uD83E\uDDB0 \uD83E\uDDD1\u200D\uD83E\uDDB0 \uD83D\uDC68\u200D\uD83E\uDDB0",
            "\uD83E\uDDB9\uD83C\uDFFE\u200D♂️ \uD83E\uDD36\uD83C\uDFFE \uD83E\uDDD1\uD83C\uDFFE\u200D\uD83C\uDF84 \uD83C\uDF85\uD83C\uDFFE \uD83E\uDDD9\uD83C\uDFFE\u200D♀️",
            "\uD83D\uDC31 \uD83D\uDC2D \uD83D\uDC39 \uD83D\uDC30\uD83E\uDD8A \uD83D\uDC3B",
            "\uD83C\uDF31 \uD83C\uDF3F ☘️ \uD83C\uDF40 \uD83C\uDF8D \uD83E\uDEB4 \uD83C\uDF8B",
            "\uD83C\uDF37 \uD83E\uDEB7 \uD83C\uDF39 \uD83E\uDD40 \uD83C\uDF3A \uD83C\uDF38 \uD83C\uDF3C \uD83C\uDF3B",
            "\uD83C\uDF1F ✨ ⚡️ ☄️ \uD83D\uDCA5 \uD83D\uDD25\uD83C\uDF2A \uD83C\uDF08 ☀️",
            "\uD83D\uDC95 \uD83D\uDC9E \uD83D\uDC93 \uD83D\uDC97 \uD83D\uDC96 \uD83D\uDC98 \uD83D\uDC9D"};

    public static String[] attitude_shayary={"ઓળખાણ તો બહુ મોટી છે વ્હાલા પણ દેખાડો કરવો એ અમારી આદત નથી",
            "નથી જતા અમે એવી કોઈ મહેફિલમાં સાહેબ જ્યાં બે કોડીના માણસો પોતાની હેસિયતના ગુણગાન ગાતા હોય",
            "માનું છું કે મારામાં બાદશાહ જેવી કોઈ વાત નથી, પણ મારા જેવું બનવાની કોઈ બાદશાહની પણ ઔકાત નથી",
            "તકલીફ હોય તો સામે થી કહેજો વહાલા જો પાચલ થી ઘા કર્યા તો તકલીફ બમણી થઇ જશે",
            "વીધી સાથે વેર ના થાય અને જીવન આખું ઝેર ના થાય મારું બોલેલું છાપેલો કાગળ છે એમાં ફેરફાર ના થાય",
            "લાગણીના સંબંધના નામે ઝૂકવું પડે છે બાકી દુનિયા ઝુકાવી જાય એ વાતમાં દમ નથી",
            "મને મારી લાગણીઓ રોકી રાખે છે બાકી રમત રમતા તો મને પણ આવડે છે",
            "જે લોકો મને નફરત કરે છે એ ખુશીખુશી કરો કારણ કે હું બધા ને પ્રેમ ને કાબીલ નથી સમજતો",
            "કિનારો ના મળે તો ભલે ના સહી, પણ ડુબાડી બીજા ને ક્યારેય તરવું નથી મારે",
            "હક થી આપ તો તારી નફરત પણ કબૂલ છે, ભીખ માં તો તારો પ્રેમ પણ નહિ"};

    public static String[] love_shayary={"કદાચ લોકો નઇ, પણ તું તો સમજી શકેને? કે ચૂપ રહેતા ને પણ, દુઃખ તો થાય જ છે.❣",
            "મેં હવે કહેવાનું છોડી દેવું છે કોઈ ને પણ, કેમકે લોકો શબ્દો નો ખોટો અર્થ બહુ કાઢે છે.",
            "તારા પ્રેમ એ કંઇક એ રીતે શણગાર્યો છે મને, અરીસો પણ કહે છે, “મારી શુ જરૂરત છે તને!",
            "અમસ્તાજ હોઠો પર એક મીઠું હાસ્ય આવી જાય છે, આમજ બેઠો હોઉં છું ને તારો ખ્યાલ આવી જાય છે.",
            "મિજાજ તારો નારાજ થવાનો ને હું મનાવાનો શોખ રાખું છું લાગણીશીલ વ્યક્તિ છું ને શબ્દો ની આખી ફૌજ રાખુ છું",
            "પ્રેમ કરવા વાળા હજારો મળી જશે,સાહેબ તલાશ એની કરો જે નિભાવી જાણે..!!",
            "પ્રેમ ના કોઈ પૂરાવા નથી હોતા, પણ એનું નામ સાંભળતા, તમારા ધબકારા વધી જાય તો સમજો પ્રેમ છે…",
            "મને એક ગિફ્ટ જોઈએ છે, અને એ ગિફ્ટ માં તું જોઈએ છે.",
            "એક વાત કહું જે લોકો દિલના સાચા હશે ને… એ નારાજ ભલે થાય પણ ક્યારેય તમને છોડી ને નઈ જાય…!!",
            "હક થી પૂછશો તો શ્વાસે શ્વાસની ખબર આપીશ, જો શંકા એ સ્થાન લીધું તો મોત ની પણ ખબર નહિ આપું…"};

    public static String[] birthday_shayary={"આજના જન્મ દિવસે… આપને આનંદી મન મુબારક ખૂંટે નહી તેટલું ધન મુબારક તંદુરસ્તી ભર્યું તન મુબારક આપને જન્મ દિવસ મુબારક",
            "તમારો જન્મદિન છે “ખાસ” કેમ કે તમે છો સૌનાં દિલની ‘પાસ’ અને આજે પૂરી થાય તમારી બધી જ “આશ”",
            "ખૂબ ખુશીઓથી જીવ્યું છે તમે જીવન અને આ જ રીતે જીવતા રહો, હંમેશાં ખુશીઓના ઘૂંટડા પીતા રહો હેપ્પી બર્થ ડે",
            "ખુશીમાં વીતે તમામ દિવસો દરેક રાત સુહાની હોય જે તરફ પણ તમારા પગ પડે એ તરફ ફૂલોનો વરસાદ હોય.",
            "જન્મદિન મુબારક મારા યાર, ખુશીઓ મળે તમને બેશુમાર તમે ભૂતકાળમાં જે આનંદ ફેલાવ્યો હતો એ આજના દિવસે તમને પાછો મળે. તમને જન્મદિનની શુભેચ્છા.",
            "હું આશા રાખું છું કે તમે તમારા જીવનમાં જે ઇચ્છો છો તેનાથી તમે બમણું મેળવો.",
            "ભગવાન તમારું જીવન તેજસ્વી સ્મિત અને વધુ આનંદથી ભરે જન્મદિવસની શુભકામના પપ્પા",
            "હું તમને જન્મદિન પર કંઈક અદ્ભૂત અને પ્રેરણાદાયક આપવા માગતો હતો પણ પછી મને લાગ્યું કે હું તો તમારી સાથે જ છું."};

    public static String[] child_shayary={"નવજાત બાળકો જીવનને તાજું કરે છે અને હૃદયને તેજ કરે છે.",
            "બાળકો એકમાત્ર માનવી છે જે એકદમ માનનીય છે અને જાણતા નથી…",
            "તમારા પોતાના કહેવા માટે એક નવો ચમત્કાર! અભિનંદન!",
            "અમે નવા સભ્યને કારણે તમને અને તમારા પરિવારને દરેક આશીર્વાદની ઇચ્છા કરીએ છીએ. અભિનંદન! તમારા બધા માટે સ્વાસ્થ્ય અને ખુશીની પ્રાર્થના.",
            "મંઝિલ તમારી યાત્રાથી ઘણી દૂર છે. નાનકડી આ જીંદગીમા ફિકર ગનીબધી છે. દુનિયા આવો, તમે મને મારી નાખશો પણ બાપ એ પ્રેમ નો પ્રેમ નથી...!",
            "હસ્ત રેખા માં એવું તો શું હશે જન્મેલ બાળક પણ મૂઠી વળેલી રાખતું હશે ??",
            "દરેક બાળક એવો સંદેશ લઈ ને આવે છે કે ભગવાન હજુ માણસ થી નિરાશનથી થયા",
            "પૈસા નો એક સિક્કો મળ્યો જાણે ખોવાયેલો મારો બાણપણ નો એક હિસ્સો મળ્યો",
            "એક બાળક આવતા ની સાથે જ સુનસાન ઘર હસતું ખિલતું થય જે છે."};

    public static String[] bewfa_shayary={"વાંઘો નહી તારી વફા નહી મળી મને દુઆ કરૂ કે કોઇ બેવફા ન મળે તને",
            "ખુદને બેવફા સમજી તને ભુલી જઇશ ૫ણ દુનિયા સામે તને બેવફા કહી બદનામ નહી કરુ.",
            "ભુલાવી દઇશ તને ૫ણ થોડી ઘીરજ તો રાખ તારી જેમ મતલબી બનતા મને થોડો સમય લાગશે.",
            "પ્રમના પ્યાલા થોડા હળવેકથી પીજો હોઠ તો ૫ચાવી લેશે ૫ણ દીલને બહુ તકલીફ ૫ડશે.",
            "ચા ☕️ ની ચાહ રાખો બાકી સનમ તો બેવફા જ હોય છે…",
            "દોસ્તીનો સંબંધ પ્રેમથી પણ મોટો છે, કારણ કે દોસ્ત ક્યારેય બેવફા નથી હોતો !!",
            "અમે તમારી યાદ માં રોઈ રોઈ ને ટબ ભરી દીધા તમે એટલા બેવફા નીકળ્યા, નાહી ધોઈ ને ચાલી નીકળ્યા…!!!",
            "પ્રેમ બે જણા વચ્ચે નશો છે જેને પહેલા હોશ હોય આવી જાય તે બેવફા હોય છે",
            "ભાદરવા ની ભર બપોરે મેં રમ્યો એની નજર નો સટ્ટો હારી ગયા આજે અમે, બેવફા નીકળ્યો એનો દુપટ્ટો",
            "ઘણી જ વસંત ઋતુઓ તૈયાર છે આ બાગમાં પ્રવેશ કરવા પણ આ બાગ જ એ બેવફા પાનખર સાથે વફા નિભાવી રહ્યોં છે…"};
}